_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 46, 46, 128)       1280      
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 44, 44, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 22, 22, 128)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 22, 22, 128)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 20, 20, 128)       147584    
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 18, 18, 128)       147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 9, 9, 128)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 9, 9, 128)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 7, 7, 512)         590336    
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 5, 5, 512)         2359808   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 512)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
dropout_3 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_4 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 7)                 7175      


we tried to implement the strcuture implemented in VGG models.

